Autodesk.Revit.DB.IFC.IFCImportOptions.SetExtraOptions(System.Collections.Generic.IDictionary{System.String,System.String})
Set the list of extra options to be passed into the importer.  Each entry in the map is a pair of option name and value.
Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
options:
The list of options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.IFC.IFCImportOptions.GetExtraOptions
Get the list of extra options to be passed into the importer.  Each entry in the map is a pair of option name and value.
Returns:
The list of options.
Since:
2018.1

Autodesk.Revit.DB.IFC.IFCImportOptions.GetConversionData
Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCImportOptions.RevitLinkFileName
The full path of the intermediate Revit file created during a previous link action.
This is used during "Reload From" to determine the path to the previous generated Revit file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.CreateLinkInstanceOnly
Determines whether to create a linked symbol element or not.
Remarks:
If this value is false (default), we will create a linked symbol and instance.
If this value is true, then we will re-use an existing linked symbol file and create an instance only.
The intention is for CreateLinkInstanceOnly to be true when we are trying to create a new link, when the link already exists in the host file.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.ForceImport
Force the IFC file to be imported regardless of an existing corresponding Revit file.
Remarks:
If this value is true (default), we will perform the import even if the existing corresponding Revit file is up-to-date.
If this value is false, then we will re-use an existing RVT file if it is up-to-date.
The intention is for ForceImport to be false during host file open while reloading links,
and true during link reload via the Manage Links API.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.Action
The action of the import.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.AutocorrectOffAxisLines
Enable or disable correcting lines that are slight off-axis.
Remarks:
Enabling correcting lines that are slightly off-axis will snap lines that are close to axes
to the nearest axis.  This will reduce warnings in Revit, but may cause elements that are created
from sketches to slightly change shape, and extrusions to slightly change directions.
Disabling this option will leave the original geometry intact but may cause warnings in Revit.
Default is true for Open IFC; it is ignored (and false) for Link IFC.
Since:
2016

Autodesk.Revit.DB.IFC.IFCImportOptions.AutoJoin
Enable or disable auto-join at the end of import.
Remarks:
Enabling auto-join will join appropriate elements (e.g., walls, columns), but will take extra time and may fail.
Disabling auto-join will allow some imports that otherwise fail.
Default is true for Open IFC; it is ignored (and false) for Link IFC.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.Intent
The intent of the import.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions.#ctor
Constructs a new IFCImportOptions using default settings.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportOptions
IFC Import options.
Since:
2015